matrix = [['Установка первичной переработки 1', 1, 2, 1],
         ['Установка первичной переработки 2', 1, 2, 1],
         ['Вакуумный блок 1', 2, 3, 2],
         ['Вакуумный блок 2', 2, 3, 3],
         ['Установка вторичной переработки 1', 3, 4, 7],
         ['Установка вторичной переработки 2', 3, 4, 6],
         ['Установка каталитического кренинга 1', 4, 5, 1],
         ['Установка каталитического кренинга 2', 4, 5, 2],
         ['Станция смешения 1', 5, 6, 3],
         ['Станция смешения 2', 5, 6, 6],
         ['Комбинированная установка переработки', 1, 4, 12],
         ['Комбинированная установка каталитического кренинга', 4, 6, 15],
         ['Сепаратор', 1, 3, 8],
         ['Установка риформинга', 3, 5, 4],
         ['Установка висбрекинга', 4, 6, 17],
         ['Афипский НПЗ', 1, 6, 34],
         ['Антипинский НПЗ', 1, 6, 45]]




WAYS = []
for edge in matrix:
   if edge[1] == 1:
       WAYS.append([edge[3], edge[0], edge[2]])


flag = True
ways = []
while flag:
   flag = False
   ways = []
   for edge in WAYS:
       i = edge[-1]
       if i == 6:
          ways.append(edge)
          continue
       else:
           flag = True
       for e in matrix:
           if e[1] == i:
               ways.append([edge[0] + e[3], edge[1] + " -> " + e[0], e[2]])
   WAYS = ways




i_max = 0
i_min = 0
for i in range(len(WAYS)):
   if WAYS[i][0] > WAYS[i_max][0]:
       i_max = i
   if WAYS[i][0] < WAYS[i_min][0]:
       i_min = i




print(f"Самый дешевый ({WAYS[i_min][0]}):")
print(WAYS[i_min][1])


print()


print(f"Самый дорогой ({WAYS[i_max][0]}):")
print(WAYS[i_max][1])





